lecture-01/notes.tex
% Created 2020-07-10 Fri 11:33
% Intended LaTeX compiler: pdflatex
\documentclass[bigger]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{default}
\author{Vincent Toups}
\date{2020-06-10 Tue}
\title{Lecture 1: Introduction to Introduction to Data Science}
\hypersetup{
 pdfauthor={Vincent Toups},
 pdftitle={Lecture 1: Introduction to Introduction to Data Science},
 pdfkeywords={data science, data analysis, R, git, Docker, Make},
 pdfsubject={Lecture 1 of BIOS 611: Intro To Data Science},
 pdfcreator={Emacs 25.2.1 (Org mode 9.3.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}


\section{Lecture 01 - Introduction to the Course}
\label{sec:orgfd11ce5}

\subsection{About Me}
\label{sec:org8b1bf4b}

\begin{itemize}
\item Dr Vincent Toups
\item Neuroscientist by way of the UNC Physics Department
\item Software Engineer and Data Scientist
\item Programming Language Enthusiast / Weirdo
\item Data Operations Guy
\end{itemize}

\subsection{About This Course - Introduction to Data Science}
\label{sec:orgcf5e1d7}

\begin{itemize}
\item What I did at my last job
\item What I do at my current job
\item Data Science vs Statistics Perfectly illustrated by the difference
between Neural Networks and Regression. Data Scientist is to Neural
Networks as the Statistician is to Linear Regression that is
\begin{itemize}
\item the former wants to extract actionable predictions in a probably
non-mission critical setting and isn't particularly concerned
about putting a fine point on the interpretation
\item the latter is more precise, interested in quantifying power,
interpretation of models, laying out the exact assumptions that go
into an analysis
\item there is overlap
\item I am a data scientist - you will be shocked, I'm sure, about what
I don't know about statistics.
\end{itemize}
\item Data Scientists are also pretty heterogeneous. I have worked with
physicists, mathematicians, statisticians, and software engineers
who are all called data scientists.
\item Opportunistic skill accumulators: a good data scientist will know
some statistics, machine learning, software engineering, dev ops,
and be comfortable (like a statistician) becoming familiar with new
domains.
\end{itemize}

This course is about giving you a taste of that opportunistic skill
set.

Its also about affirmation: you can do this stuff. The most crufty
linux shell wizardry is no more complicated that bonafide
biostatistics and probably at least half as useful.

\subsection{Goals}
\label{sec:orge0ff208}

\begin{enumerate}
\item Comfort with Developer Tools
Docker, Make, Git, Linux
\item Survey of Data Scientific Techniques and How to Understand them
\item Deeper Appreciation of The Art of Programming
\end{enumerate}

\subsection{Today: Our Basic Environment and Tools}
\label{sec:org714244e}

\begin{enumerate}
\item Demo - Compute
\item Demo - Storage
\item Demo - Docker
\item Demo - Git
\item Demo - Rstudio

\item Demo - Human and Dog Names
\end{enumerate}
\end{document}
